Revit 2027 API
TableMergedCell.Right Property
 Specifies the column index of the bottom-right corner of a table grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Right { get; set; }
Public Property Right As Integer
	Get
	Set
public:
property int Right {
	int get ();
	void set (int value);
}
member Right : int with get, set
Property Value
Int32
See Also
Reference
TableMergedCell Class
Autodesk.Revit.DB Namespace